Revit 2027 API
BuiltInFailures.ElectricalFailures.MismatchNmbOfPolesAssignPanel Property
 Cannot assign [Element] to Circuit. The Number of Poles for [Element] does not match the Number of Poles ([Name]) for the Circuit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MismatchNmbOfPolesAssignPanel { get; }
Public Shared ReadOnly Property MismatchNmbOfPolesAssignPanel As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MismatchNmbOfPolesAssignPanel {
	FailureDefinitionId^ get ();
}
static member MismatchNmbOfPolesAssignPanel : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace